[{"_id": "55244d89a490497ca884229f8ed5c104", "title": "Avengers - Infinity", "director": "Joe", "year": 2018, "cast": ["Chris Evans", "Elizabeth Oslen"], "series": ["Avengers", "MCU"], "tags": ["Super hero"], "description": "I honestly don’t believe any media will ever achieve the level of worldwide hype and anticipation that Infinity War and brought. Even as the MCU expands into phase 4 and beyond, this was truly a once in a lifetime experience", "video_link": "https://www.youtube.com/embed/QwievZ1Tx-8"}, {"_id": "97f6f0594efe4c9989294389b5cd1093", "title": "Toy story", "director": "Unk", "year": 2000, "cast": [], "series": ["toy story"], "tags": ["animation", "toys"], "description": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.", "video_link": "https://www.youtube.com/embed/rNk1Wi8SvNc"}, {"_id": "ab788307cc6b49e3b75bad76d0b512c6", "title": "Avengers - Endgame", "director": "Joee", "year": 2019, "cast": ["Robert Downey Jr.", "Chris Evans", "Mark Ruffalo", "Chris Hemsworth", "Scarlett Johansson"], "series": ["MCU", "The Avengers"], "tags": ["superhero", "marvel"], "description": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse the destruction caused by Thanos in Infinity War.", "video_link": "https://www.youtube.com/embed/TcMBFSGVi1c"}, {"_id": "c7a847cf6fdd4a039dcf74c4c89d728f", "title": "Thor - Love and Thunder", "director": "Taika Waititi", "year": 2022, "cast": ["Chris Hemsworth", "Christian Bale", "Tessa Thompson", "Jaimie Alexander", "Taika Waititi", "Russell Crowe", "Natalie Portman"], "series": ["Thor", "MCU"], "tags": ["super hero", "thor"], "description": "Thor: Love and Thunder is a 2022 American superhero film based on the Marvel Comics character Thor, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the direct sequel to Thor: Ragnarok (2017) and the 29th film in the Marvel Cinematic Universe (MCU). The film is directed by Taika Waititi, who co-wrote the script with Jennifer Kaytin Robinson, and stars Chris Hemsworth as Thor alongside Christian Bale, Tessa Thompson, Jaimie Alexander, Waititi, Russell Crowe, and Natalie Portman. In the film, Thor attempts to find inner peace, but must return to action and recruit Valkyrie (Thompson), Korg (Waititi), and Jane Foster (Portman)—who is now the Mighty Thor—to stop Gorr the God Butcher (Bale) from eliminating all gods.", "video_link": "https://www.youtube.com/embed/Go8nTmfrQd8"}]